Revit 2027 API
BuiltInFailures.CurtainWallFailures.CurtainSystemHostInvisible Property
 Element defining the Curtain System is invisible in the current view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurtainSystemHostInvisible { get; }
Public Shared ReadOnly Property CurtainSystemHostInvisible As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurtainSystemHostInvisible {
	FailureDefinitionId^ get ();
}
static member CurtainSystemHostInvisible : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace